<?php
return [
    'index' => 'محصولات',
    'create' => 'ایجاد محصول جدید',
    'edit' => 'ویرایش محصول',
    'delivery' => [
        'index' => 'روش های ارسال',
        'create' => 'ایجاد روش ارسال',
        'edit' => 'ویرایش روش ارسال',
    ],
    'color' => [
        'index' => 'رنگ های محصول',
        'create' => 'اضافه کردن رنگ به محصول',
        'edit' => 'ویرایش رنگ محصول',
    ] ,
    'warranty' => [
        'index' => 'گارانتی های محصول',
        'create' => 'اضافه کردن گارانتی به محصول',
        'edit' => 'ویرایش گارانتی محصول',
    ]
];
